const FactionsDatabase = {
    "Торговый молот": {
        requirement: "Дворфы",
        positiveFeatures: ["💰 Золотая жила: +2 к проверкам Торговли и Убеждения."],
        negativeFeatures: ["🤲 Белоручки: -1 к Атлетике."]
    },
    "Чертежная гвардия": {
        requirement: "Дворфы",
        positiveFeatures: ["⚙️ Инженерный гений: +2 к Ремеслу и механизмам."],
        negativeFeatures: ["🤐 Ксенофобия: -2 к проверкам общения с чужаками."]
    },
    "Железный легион": {
        requirement: "Все",
        positiveFeatures: ["⚔️ Легионерская выучка: +1 к физической броне в строю."],
        negativeFeatures: ["📜 Жесткий устав: Обязан подчиняться приказам офицеров."]
    }
};